// package figure;
import java.util.*;

public class Quadrilateral {
	public static String[] qtypes = {"Convex quadrilateral", "Parallelogram", "Rectangle", "Square", "Rhombus", "Trapeze", };

/* "Трапеция" - это геометрическая фигура, которая имеет четыре стороны, 
из которых две параллельны и называются основаниями, а другие две называются боковыми сторонами. 
Высота трапеции - это перпендикуляр, опущенный из одного основания на другое. 
Чтобы вычислить площадь трапеции требуется сложить длину двух оснований, 
а затем умножить полученную сумму на высоту, разделенную на два: S=(a+b)h/2. 
Трапеции могут быть равнобедренными (когда боковые стороны и основания равны попарно) 
или неравнобедренными (когда основания и боковые стороны различны). 
Также трапеции могут быть прямоугольными (когда одно из оснований перпендикулярно боковой стороне 
в точке их пересечения). */

}